aircrack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-29 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<p>
#TITLE: aircrack-ng
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> debugging</h2>
<div class="outline-text-2" id="text-1">
<p>
if you cannot enter monitor/promiscuous mode, killing everything using the
interface may help
</p>

<pre class="example" id="org0000000">
airmon-ng check kill
</pre>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> monitor mode</h2>
<div class="outline-text-2" id="text-2">
<p>
many guides use deprecated <code>iwconfig</code> for this, however <code>iw</code> should be
used instead
</p>

<pre class="example" id="org0000001">
iw &lt;interface&gt; set monitor &lt;mode&gt;
</pre>
<p>
where <code>&lt;interface&gt;</code> is your device name (ie <code>wlan0</code>), and <code>&lt;mode&gt;</code> is
what you want to monitor (probably <code>control</code> or <code>none</code>)
</p>

<p>
alternatively, starting many aircrack utilities including <code>airmon-ng</code>
or <code>besside-ng</code> will put it into monitor mode for you
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">3.</span> return to normal networking</h2>
<div class="outline-text-2" id="text-3">
<p>
you will need to exit monitor mode, set the interface to up, and
restart all the things killed. an easy way to do this is with your
init system's networking (or similar) service.
</p>

<pre class="example" id="org0000002">
service networking restart
</pre>
<p>
will do so on alpine (openrc)
</p>
</div>
</div>
</div>
</body>
</html>
